In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
import seaborn as sns

### CHECKING DATA

In [3]:
with open("../dataset/data.csv", "r") as datafile:
    data = pd.read_csv(datafile)

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

In [5]:
data

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France

In [6]:
print(data["CustomerID"].value_counts().sort_index())

CustomerID
12346.0      2
12347.0    182
12348.0     31
12349.0     73
12350.0     17
          ...
18280.0     10
18281.0      7
18282.0     13
18283.0    756
18287.0     70
Name: count, Length: 4372, dtype: int64

In [7]:
print(type(data["InvoiceNo"].value_counts()))

<class 'pandas.core.series.Series'>

In [8]:
data_list = list(data["InvoiceNo"].value_counts())
data_l = []
for x in data_list:
    if x < 10:
        data_l.append(x)

len(data_l)

12733

In [9]:
unique_dates_per_customer = data.groupby('CustomerID')[['InvoiceDate', 'Quantity']].nunique()
unique_dates_per_customer

            InvoiceDate  Quantity
CustomerID
12346.0               2         2
12347.0               7        15
12348.0               4        10
12349.0               1        12
12350.0               1         5
...                 ...       ...
18280.0               1         5
18281.0               1         4
18282.0               3         9
18283.0              16        10
18287.0               3        10

[4372 rows x 2 columns]

In [10]:
countries_per_customer = data.groupby('Country')[['CustomerID', 'InvoiceDate']].nunique()
countries_per_customer.reset_index()

                 Country  CustomerID  InvoiceDate
0              Australia           9           66
1                Austria          11           19
2                Bahrain           2            4
3                Belgium          25          119
4                 Brazil           1            1
5                 Canada           4            6
6        Channel Islands           9           33
7                 Cyprus           8           20
8         Czech Republic           1            5
9                Denmark           9           21
10                  EIRE           3          359
11    European Community           1            5
12               Finland          12           48
13                France          87          461
14               Germany          95          598
15                Greece           4            6
16             Hong Kong           0           15
17               Iceland           1            7
18                Israel           4            9
19                 Italy          15           55
20                 Japan           8           29
21               Lebanon           1            1
22             Lithuania           1            4
23                 Malta           2           10
24           Netherlands           9          101
25                Norway          10           40
26                Poland           6           24
27              Portugal          19           71
28                   RSA           1            1
29          Saudi Arabia           1            2
30             Singapore           1           10
31                 Spain          31          105
32                Sweden           8           45
33           Switzerland          21           73
34                   USA           4            7
35  United Arab Emirates           2            3
36        United Kingdom        3950        21220
37           Unspecified           4           13

In [12]:
dateCount = unique_dates_per_customer['InvoiceDate']
amount = unique_dates_per_customer['Quantity']
count = 0

for _, x in unique_dates_per_customer.iterrows():
    if x['InvoiceDate'] == 1 and x['Quantity'] <= 3:
        count += 1
count

302

In [13]:
data["CustomerID"].nunique()

4372

In [14]:
unique_dates_per_customer = data.groupby('CustomerID')[['Description']].count()
unique_dates_per_customer

            Description
CustomerID
12346.0               2
12347.0             182
12348.0              31
12349.0              73
12350.0              17
...                 ...
18280.0              10
18281.0               7
18282.0              13
18283.0             756
18287.0              70

[4372 rows x 1 columns]

In [15]:
counts = data.groupby('CustomerID').agg(
    total_descriptions=('Description', 'count'),
    unique_descriptions=('Description', 'nunique')
).reset_index()
counts

      CustomerID  total_descriptions  unique_descriptions
0        12346.0                   2                    1
1        12347.0                 182                  103
2        12348.0                  31                   22
3        12349.0                  73                   73
4        12350.0                  17                   17
...          ...                 ...                  ...
4367     18280.0                  10                   10
4368     18281.0                   7                    7
4369     18282.0                  13                   12
4370     18283.0                 756                  272
4371     18287.0                  70                   59

[4372 rows x 3 columns]

In [16]:
negative = data["Quantity"]
num_negative = 0
for item in negative:
    if item < 0:
        num_negative += 1

num_negative

10624

In [17]:
df_negative = data[data["Quantity"] < 0]
df_negative

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
141,C536379,D,Discount,-1,12/1/2010 9:41,27.50,14527.0,United Kingdom
154,C536383,35004C,SET OF 3 COLOURED FLYING DUCKS,-1,12/1/2010 9:49,4.65,15311.0,United Kingdom
235,C536391,22556,PLASTERS IN TIN CIRCUS PARADE,-12,12/1/2010 10:24,1.65,17548.0,United Kingdom
236,C536391,21984,PACK OF 12 PINK PAISLEY TISSUES,-24,12/1/2010 10:24,0.29,17548.0,United Kingdom
237,C536391,21983,PACK OF 12 BLUE PAISLEY TISSUES,-24,12/1/2010 10:24,0.29,17548.0,United Kingdom
...,...,...,...,...,...,...,...,...
540449,C581490,23144,ZINC T-LIGHT HOLDER STARS SMALL,-11,12/9/2011 9:57,0.83,14397.0,United Kingdom
541541,C581499,M,Manual,-1,12/9/2011 10:28,224.69,15498.0,United Kingdom
541715,C581568,21258,VICTORIAN SEWING BOX LARGE,-5,12/9/2011 11:57,10.95,15311.0,United Kingdom
541716,C581569,84978,HANGING HEART JAR T-LIGHT HOLDER,-1,12/9/2011 11:58,1.25,17315.0,United Kingdom
541717,C581569,20979,36 PENCILS TUBE RED RETROSPOT,-5,12/9/2011 11:58,1.25,17315.0,United Kingdom

In [18]:
df_negative_data = data.loc[data["Quantity"] < 0, "CustomerID"]
df_negative_data

141       14527.0
154       15311.0
235       17548.0
236       17548.0
237       17548.0
           ...
540449    14397.0
541541    15498.0
541715    15311.0
541716    17315.0
541717    17315.0
Name: CustomerID, Length: 10624, dtype: float64

In [19]:
df_negative_data = (
    df_negative.groupby("CustomerID")["Quantity"]
    .nunique()
    .reset_index(name="unique_negative_count")
)

df_negative_data

      CustomerID  unique_negative_count
0        12346.0                      1
1        12352.0                      4
2        12359.0                      2
3        12362.0                      4
4        12365.0                      1
...          ...                    ...
1584     18272.0                      2
1585     18274.0                      6
1586     18276.0                      1
1587     18277.0                      1
1588     18282.0                      1

[1589 rows x 2 columns]

In [20]:
negative_counts = df_negative.groupby('CustomerID').agg(
    total_descriptions=('Description', 'count'),
    total_quantity=('Quantity', 'count'),
    unique_descriptions=('Description', 'nunique'),
    unique_invoice=('InvoiceNo', 'nunique'),
    unique_date=('InvoiceDate', 'nunique')
    
).reset_index()
negative_counts

,CustomerID,total_descriptions,total_quantity,unique_descriptions,unique_invoice,unique_date
0,12346.0,1,1,1,1,1
1,12352.0,10,10,8,3,3
2,12359.0,6,6,6,2,2
3,12362.0,8,8,8,3,3
4,12365.0,1,1,1,1,1
...,...,...,...,...,...,...
1584,18272.0,4,4,4,1,1
1585,18274.0,11,11,11,1,1
1586,18276.0,2,2,1,2,2
1587,18277.0,1,1,1,1,1
1588,18282.0,1,1,1,1,1

In [21]:
#  as we can see we have 1589 of orders are returned. not really that just number of customers only. all returned values are 10624.

In [22]:
# Step 1: Identify returns and their original purchases
# -----------------------------------------------------
df = data

# Step 1: Create unique transaction ID for matching purchases/returns
df['TransactionID'] = (df['CustomerID'].astype(str) + '_' + 
                       df['StockCode'] + '_' + 
                       df['UnitPrice'].round(2).astype(str) + '_' + 
                       df['Quantity'].abs().astype(str))

# Step 2: Add returned flag (1 for returns, 0 for purchases)
df['returned'] = 0

# Step 3: Identify matching purchases for returns
return_mask = df['Quantity'] < 0
return_keys = df.loc[return_mask, 'TransactionID']

# Step 4: Mark original purchases that were returned
df.loc[df['TransactionID'].isin(return_keys) & (df['Quantity'] > 0), 'returned'] = 1

# Step 5: Remove return rows (negative quantities)
clean_df = df[df['Quantity'] >= 0].copy()

# Optional: Add customer return statistics
customer_returns = clean_df.groupby('CustomerID')['returned'].agg(
    total_returns='sum',
    return_rate='mean'
).reset_index()

clean_df = clean_df.merge(customer_returns, on='CustomerID', how='left')

# Cleanup
clean_df.drop('TransactionID', axis=1, inplace=True)

# Verify results
print(f"Original rows: {len(df)}")
print(f"Cleaned rows: {len(clean_df)}")
print(f"Marked returns: {clean_df['returned'].sum()}")
print(clean_df[['InvoiceNo', 'StockCode', 'Quantity', 'returned']].head())

Original rows: 541909
Cleaned rows: 531285
Marked returns: 5714
  InvoiceNo StockCode  Quantity  returned
0    536365    85123A         6         0
1    536365     71053         6         0
2    536365    84406B         8         0
3    536365    84029G         6         0
4    536365    84029E         6         0

In [23]:
one = 0
for x in clean_df['returned']:
    if x != 1:
        one += 1
one

525571

In [24]:
df

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,TransactionID,returned
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,17850.0_85123A_2.55_6,0
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,17850.0_71053_3.39_6,0
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom,17850.0_84406B_2.75_8,0
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,17850.0_84029G_3.39_6,0
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,17850.0_84029E_3.39_6,0
...,...,...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France,12680.0_22613_0.85_12,0
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France,12680.0_22899_2.1_6,0
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France,12680.0_23254_4.15_4,0
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France,12680.0_23255_4.15_4,0
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France,12680.0_22138_4.95_3,0

In [25]:
data['return'] = clean_df['returned']

In [27]:
data = data.drop(columns=['TransactionID'])

In [28]:
data = data.drop(columns=['returned', 'return'])

In [29]:
data

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France

In [31]:
clean_df[['InvoiceNo', 'StockCode', 'Quantity', 'returned']].tail()

       InvoiceNo StockCode  Quantity  returned
531280    581587     22613        12         0
531281    581587     22899         6         0
531282    581587     23254         4         0
531283    581587     23255         4         0
531284    581587     22138         3         0

In [32]:
clean_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 531285 entries, 0 to 531284
Data columns (total 11 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   InvoiceNo      531285 non-null  object
 1   StockCode      531285 non-null  object
 2   Description    530693 non-null  object
 3   Quantity       531285 non-null  int64
 4   InvoiceDate    531285 non-null  object
 5   UnitPrice      531285 non-null  float64
 6   CustomerID     397924 non-null  float64
 7   Country        531285 non-null  object
 8   returned       531285 non-null  int64
 9   total_returns  397924 non-null  float64
 10  return_rate    397924 non-null  float64
dtypes: float64(4), int64(2), object(5)
memory usage: 44.6+ MB

In [33]:
clean_df

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,returned,total_returns,return_rate
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,0,34.0,0.114478
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,0,34.0,0.114478
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom,0,34.0,0.114478
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,0,34.0,0.114478
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,0,34.0,0.114478
...,...,...,...,...,...,...,...,...,...,...,...
531280,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France,0,0.0,0.000000
531281,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France,0,0.0,0.000000
531282,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France,0,0.0,0.000000
531283,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France,0,0.0,0.000000
531284,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France,0,0.0,0.000000

In [34]:
clean_df['returned'].isnull().sum()

np.int64(0)

In [35]:
purchase_counts = data.groupby('CustomerID').size()
print(purchase_counts)

CustomerID
12346.0      2
12347.0    182
12348.0     31
12349.0     73
12350.0     17
          ...
18280.0     10
18281.0      7
18282.0     13
18283.0    756
18287.0     70
Length: 4372, dtype: int64

In [37]:
# First calculate total expense per row
clean_df['TotalExpense'] = clean_df['Quantity'] * data['UnitPrice']

# Group by CustomerID
customer_summary = clean_df.groupby('CustomerID').agg(
    total_purchases=('InvoiceNo', 'nunique'),  # total number of invoices
    total_spent=('TotalExpense', 'sum')        # total money spent
).reset_index()

print(customer_summary)

      CustomerID  total_purchases  total_spent
0        12346.0                1     61598.45
1        12347.0                7     16526.01
2        12348.0                4      8235.53
3        12349.0                1      2975.81
4        12350.0                1       642.40
...          ...              ...          ...
4334     18280.0                1       133.41
4335     18281.0                1       357.10
4336     18282.0                2       153.76
4337     18283.0               16      4704.99
4338     18287.0                3      5072.72

[4339 rows x 3 columns]

In [48]:
dataBase_ = pd.DataFrame()

# Step 1: Calculate total expense per row
dataBase_['TotalExpense'] = data['Quantity'] * data['UnitPrice']

# Step 2: Group by CustomerID and aggregate
customer_summary = clean_df.groupby('CustomerID').agg(
    TotalSpent=('TotalExpense', 'sum'),       # total spending
    TotalReturns=('returned', 'sum'),         # total returns
    ReturnRate=('return_rate', 'mean'),       # average return rate
    Country=('Country', 'first')              # pick the first country (usually main)
).reset_index()

print(customer_summary.head())

   CustomerID  TotalSpent  TotalReturns  ReturnRate         Country
0     12346.0    61598.45             1         1.0  United Kingdom
1     12347.0    16526.01             0         0.0         Iceland
2     12348.0     8235.53             0         0.0         Finland
3     12349.0     2975.81             0         0.0           Italy
4     12350.0      642.40             0         0.0          Norway

In [50]:
customer_summary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4339 entries, 0 to 4338
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CustomerID    4339 non-null   float64
 1   TotalSpent    4339 non-null   float64
 2   TotalReturns  4339 non-null   int64
 3   ReturnRate    4339 non-null   float64
 4   Country       4339 non-null   object
dtypes: float64(3), int64(1), object(1)
memory usage: 169.6+ KB

In [72]:
# # Convert to datetime (with automatic format detection)
# dataBase['InvoiceDate'] = pd.to_datetime(dataBase['InvoiceDate'], errors='coerce', infer_datetime_format=True)

# # Keep only the date part (remove the time)
# dataBase['InvoiceDate'] = dataBase['InvoiceDate'].dt.date

# # Optional: convert back to datetime if needed for grouping
# dataBase['InvoiceDate'] = pd.to_datetime(dataBase['InvoiceDate'])

# dataBase

In [73]:
# Convert to datetime (automatic format detection)
dataBase['InvoiceDateTime'] = pd.to_datetime(dataBase['InvoiceDate'], errors='coerce', infer_datetime_format=True)

# Extract only the date
dataBase['InvoiceDate'] = dataBase['InvoiceDateTime'].dt.date

# Extract only the time
dataBase['InvoiceTime'] = dataBase['InvoiceDateTime'].dt.time

# Optional: convert InvoiceDate back to datetime for grouping
dataBase['InvoiceDate'] = pd.to_datetime(dataBase['InvoiceDate'])

C:\Users\MSI\AppData\Local\Temp\ipykernel_12024\2076333084.py:2: UserWarning: The argument 'infer_datetime_format' is deprecated and will be removed in a future version. A strict version of it is now the default, see https://pandas.pydata.org/pdeps/0004-consistent-to-datetime-parsing.html. You can safely remove this argument.
  dataBase['InvoiceDateTime'] = pd.to_datetime(dataBase['InvoiceDate'], errors='coerce', infer_datetime_format=True)

In [74]:
dataBase

        TotalExpense InvoiceDate YearMonth InvoiceDateTime InvoiceTime
0              15.30  2010-12-01   2010-12      2010-12-01    00:00:00
1              20.34  2010-12-01   2010-12      2010-12-01    00:00:00
2              22.00  2010-12-01   2010-12      2010-12-01    00:00:00
3              20.34  2010-12-01   2010-12      2010-12-01    00:00:00
4              20.34  2010-12-01   2010-12      2010-12-01    00:00:00
...              ...         ...       ...             ...         ...
541904         10.20  2011-12-09   2011-12      2011-12-09    00:00:00
541905         12.60  2011-12-09   2011-12      2011-12-09    00:00:00
541906         16.60  2011-12-09   2011-12      2011-12-09    00:00:00
541907         16.60  2011-12-09   2011-12      2011-12-09    00:00:00
541908         14.85  2011-12-09   2011-12      2011-12-09    00:00:00

[541909 rows x 5 columns]

In [57]:
# Make sure InvoiceDate is datetime in your working DataFrame
# Convert InvoiceDate to datetime
dataBase['InvoiceDate'] = pd.to_datetime(dataBase['InvoiceDate'], dayfirst=True)

# Now create YearMonth column
dataBase['YearMonth'] = data['InvoiceDate'].dt.to_period('M')

# Calculate total expense per row
dataBase['TotalExpense'] = data['Quantity'] * data['UnitPrice']

# Group by CustomerID and YearMonth
monthly_summary = clean_df.groupby(['CustomerID', 'YearMonth']).agg(
    TotalItems=('Quantity', 'sum'),
    TotalSpent=('TotalExpense', 'sum')
).reset_index()

print(monthly_summary.head())

AttributeError: Can only use .dt accessor with datetimelike values

In [53]:
data

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,TotalExpense
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France,10.20
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France,12.60
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France,16.60
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France,16.60
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France,14.85

In [ ]:
negative_counts = df_negative.groupby('CustomerID').agg(
    total_descriptions=('Description', 'count'),
    total_quantity=('Quantity', 'count'),
    unique_descriptions=('Description', 'nunique'),
    unique_invoice=('InvoiceNo', 'nunique'),
    unique_date=('InvoiceDate', 'nunique')
    
).reset_index()
negative_counts